# all messages in bot

START_MSSG = 'Радий знову Вас бачити!🤗\nЧим можу допомогти?'

RETURN_MENU_MSSG = 'Разом з нами ви можете підтримати ЗСУ як даруючи свої \
паперові книжки, так і купуючи їх у [магазині](https://bookforces.com.ua/) \
та [instagram](https://www.instagram.com/book_forces/) \
\n \n Використовуйте меню для навігації👇'

ABOUT_PROJECT_MSSG = '📚Книжкові сили України📚\n\n\
📎 У нас є [магазин](https://bookforces.com.ua/), \
[instagram](https://www.instagram.com/book_forces/) та бот \n\n\
📎 Бот потрібен для додавання книг усіх жанрів та різного змісту \n\
🚨російською мовою не приймаємо\n\n\
📎 Після боту книжка потрапляє до магазину, де її можуть придбати щасливі \
книгомани\n\n\
📎 100% коштів, виручених з продажу книг, надходять у наш \
[Благодійний фонд](https://bookforces.com.ua/pages/about) \n\
Команда фонду підтримує підрозділи ЗСУ та забезпечує воїнів технікою і авто, \
аби вони краще мочили русню❤️‍🔥\n\n\
📎 Коли вашу книгу куплять, бот надішле сповіщення з даними для відправки😉'

FEEDBACK_MSSG = 'Виникли ідеї для співпраці або питання?\n\nНапишіть про це👇'

# FAQ:
FAQ_MSSG = 'Ми склали список найбільш розповсюджених питань та готові на них \
відповісти)\n\nОберіть питання, що Вас цікавить із списку:'

# Donate a book
GOOD_IDEA = 'Прекрасна ідея🤩\n\n\
Це займе буквально 2 хвилини і я буду підказувати вам, що потрібно робити, \
кожен крок\n\nЯкщо у процесі ви допуститесь помилки – просто почніть \
спочатку😊\n\nНатиснувши "Продовжити" ви погоджуєтесь із \
[правилами](https://bookforces.com.ua/pages/rules)👇'

BOOK_NAME_MSSG = 'Введіть повну назву книги📖\n\n\
Просто напишіть на клавіатурі та відправте мені👇'

AUTHOR_NAME_MSSG = "Так, тепер напишіть повне ім'я та прізвище автора 🤓"

ISBN_MSSG = 'Напишіть унікальний код книги - ISBN,\
 використовуючи виключно числа\n\n\
📕🔙 А знайти ISBN можна на звороті книги поряд із штрих-кодом'

PRICE_MSSG = 'Скільки Ваша книга буде коштувати? 💸 \n\
Введіть вартість, використовуючи виключно числа'

PRICE_ADVICE_MSSG = '📎Порада. Краще ставити ціну на 30%\n\
дешевше від вартості нової книги. Але, вам, і тільки вам\n\
оцінювати вартість\n\n\
📎Коли Вашу книгу придбають в магазині, уся вартість, що\n\
ви зараз вкажете - буде перерахованою у благодійний фонд,\n\
який опікується різними підрозділами ЗСУ💪'

DESCRIPTION_MSSG = 'Шукаємо опис Вашої книги у базі даних!\n\n\
Почекайте хвильку⏳'

NO_BOOK_DESCRIPTION_MSSG = '😢 На жаль, не знаходимо опис Вашої\
 книги в базі\n\n📝 Напишіть кілька слів про книгу або ж скористайтесь\
описами книг на сайтах Якабу/Буква/КнигарняЄ'

ACCEPT_DESCRIPTION_QUESTION = 'Чи підходить цей опис?👆'

ADD_CUSTOM_DESCRIPTION = 'Тоді додайте опис книги вручну. Це саме той текст, який\
 зазвичай пишуть позаду обкладинки. Але не хвилюйтесь, не\
 потрібно його переписувати😉\n\nВи можете зайти на сайт\
 будь-якої книгарні та скопіювати цей текст звідти.'

TAG_INFORMATION_MSSG = 'Супер! А тепер по черзі натисніть на усі\
 кнопки, які підходять під опис Вашої книги.'

ADD_PHOTO_MSSG = 'Прекрасно! Ми вже майже закінчили.\n\n\
Залишилось тільке одне - зробити одне фото книги та додати його'

PROCESS_GET_PHOTO_MSSG = 'Виглядає супер👍 Зберігаю'

SUCCESS_ADD_PHOTO_MSSG = 'Вашу книгу збережено! Зовсім скоро ми додамо її у інтернет магазин🙃\n\n\
Коли її куплять, бот надішле вам сповіщення з даними для відправки👇'

# buttons
DONATE_BTTN = '📕Пожертвувати книжку📕'
ABOUT_PRJ_BTTN = 'Про проєкт🔍'
FAQ_BTTN = 'FAQ❓'
FEEDBACK_BTTN = 'Написати команді ✍'
TO_MAIN_MENU_BTTN = 'На головну ↩'
CONTINUE_BTTN = 'Продовжити🚀'
ACCEPT_DESCRIPTION = 'Підходить✔️'
NOT_ACCEPT_DESCRIPTION = 'Не підходить🚫'

START_MENU_BUTTON_NAMES  = [
    ABOUT_PRJ_BTTN,
    FAQ_BTTN,
    DONATE_BTTN
]

ABOUT_PRJ_MENU_BUTTON_NAMES = [
    FAQ_BTTN,
    TO_MAIN_MENU_BTTN,
    FEEDBACK_BTTN
]

DONATE_BOOK_MENU_BUTTON_NAMES = [
    CONTINUE_BTTN,
    TO_MAIN_MENU_BTTN
]

ACCEPT_DESCRIPTION_MENU = [
    ACCEPT_DESCRIPTION,
    NOT_ACCEPT_DESCRIPTION
]


BASIC_MENU_COMMANDS = {
    '/main':[RETURN_MENU_MSSG, START_MENU_BUTTON_NAMES], 
    '/start': [RETURN_MENU_MSSG, START_MENU_BUTTON_NAMES], 
    '/about':[ABOUT_PROJECT_MSSG, ABOUT_PRJ_MENU_BUTTON_NAMES], 
    '/feedback':[FEEDBACK_MSSG, [TO_MAIN_MENU_BTTN]]
}


TAG_MENU_BUTTON = {
    'Видано після 2015 року':
    'Супер! Зафіксували новинку👌\n\
    Чи маєте ще щось додати?',

    'Український автор':
    'Супер! Зафіксували категорію "Українське"👌\n\
    Чи маєте ще щось додати?',
    
    'Періодичне видання':
    'Супер! Зафіксували категорію "Журнали"👌\n\
    Чи маєте ще щось додати?',
    
    'Художня література':
    'Супер! Зафіксували категорію "Художня література"👌\n\
    Чи маєте ще щось додати?',
    
    'Бізнес література':
    'Супер! Зафіксували категорію "Бізнес література"\n\
    Чи маєте ще щось додати?',
    
    'Наукова література':
    'Супер! Зафіксували Наукову літературу👌\n\
    Чи маєте ще щось додати?',
    
    'Non-fiction':
    'Супер! Зафіксували категорію "Популярне"\n\
    Чи маєте ще щось додати?',
    
    'Історія':
    'Супер! Зафіксували категорію "Історія"\n\
    Чи маєте ще щось додати?',
    
    'Класика':
    'Супер! Зафіксували категорію "Класика"\n\
    Чи маєте ще щось додати?',
    
    'Підручник':
    'Супер! Зафіксували категорію "Навчальні посібники"\n\
    Чи маєте ще щось додати?',
    
    'Психологія':
    'Супер! Зафіксували категорію "Психологія"👌\n\
    Чи маєте ще щось додати?',
    
    'Дитяче':
    'Супер! Зафіксували категорію "Дитяче"👌\n\
    Чи маєте ще щось додати?',
 
     '✔️Закінчити додавання категорій✔️':
    'Прекрасно! Ми вже майже закінчили. Залишилось тільке одне\
     - зробити фотографію книги та додати її як файл📎'
}


FAQ = {
    'Що буде з книжкою, якщо її не куплять?' : 
    'Якщо книга не привабить жодного з покупців, то просто так і \
    залишиться у власника😉',

    'Хто отримує кошти при купівлі книги?' : 
    'Усі кошти акамулюються на рахунку благодійного фонду “Коммон гуд”. \
    Команда фонду діє відповідно до Статуту та закуповує всі необхідні \
    речі для захисників. Фінансова звітність буде публікуватися на сайті \
    у розділі “Звітність”.',
    
    'Як я дізнаюсь, що мою книгу купили?' : 
    'У разі покупки вашої книги, вам одразу прийде сповіщення в Telegram. \
    Ви напряму відправляєте її покупцю. За доставку сплачує отримувач.',
    
    'Якщо мені не надійде книга, яку я купив?' : 
    'Якщо протягом 10 діб ви так і не отримаєте свого замовлення, ми \
    запропонуємо вам обрати іншу книгу на платформі на ту ж суму.',
    
    'Як фонд розпоряджається коштами?' : 
    'Ми стараємось не тримати кошти на рахунку більше місяця, але \
    фокусуємось на великих покупках. Наприклад дрони або автомобілі.'
}
